# GetCompUseClassASFCl

## Description
Gets the use class fill colors for alternate section fill flag of a component in an object.

```pascal
FUNCTION GetCompUseClassASFCl(
				object                                        : HANDLE;
				componentIndex                                : INTEGER;
				VAR useClassFillColorsForAlternateSectionFill : BOOLEAN): BOOLEAN;
```

```python
def vs.GetCompUseClassASFCl(object, componentIndex):
    return (BOOLEAN, useClassFillColorsForAlternateSectionFill)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a roof face, roof, Roof Style, or the Roof Preferences.|
|componentIndex|INTEGER|The index of the component.|
|useClassFillColorsForAlternateSectionFill|BOOLEAN|Returns whether or not the component is using class attributes for its alternate section fill colors.|

## See Also
VS Functions:
SetCompUseClassASFCl

## Version
Availability: from Vectorworks 2016

## Category
* Objects - Architectural